ProgessBase/Documents/ПРГ_ВводДанныхПоSLE.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПРГ_ВводДанныхПоSLE</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПРГ_ДанныеSLE</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПРГ_ВидыОперацийSLE</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗначенияSLE</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Линия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>графикРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлановоеЗначениеSLE</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактическоеЗначениеSLE</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентВыполненияSLE</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентНагрузки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПоSLE</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ProgessBase/InformationRegisters/ПРГ_ДанныеSLE.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПРГ_ДанныеSLE</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПлановоеЗначениеSLE</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическоеЗначениеSLE</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентВыполненияSLE</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентНагрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачисленоПоSLE</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидЗначенияSLE</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПРГ_ВидЗначенияSLE</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Линия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>График</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/Enums/ПРГ_ВидыОперацийSLE.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ПРГ_ВидыОперацийSLE</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводПлана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводФакта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВВодПоРезультатуРабот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводОсобыхУсловий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ProgessBase/Enums/ПРГ_ВидЗначенияSLE.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ПРГ_ВидЗначенияSLE</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПлановоеЗначениеSLE</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФактическоеЗначениеSLE</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗначениеТарифаSLE</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезультатРаботПоSLE</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсобыеУсловияSLE</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ProgessBase/Documents/ПРГ_ВводДанныхПоSLE/Ext/ObjectModule.bsl
Перем мУдалятьДвижения Экспорт;
Перем ПериодРегистрации Экспорт;

// Таблицы движений по регистрам
Перем мТаблицаДвиженийДанныеSLE;			

// Наборы движений по регистрам
Перем мДвиженияДанныеSLE;		
//#Если Клиент Тогда

//// Процедура осуществляет печать документа. Можно направить печать на 
//// экран или принтер, а также распечатать необходимое количество копий.
////
////  Название макета печати передается в качестве параметра,
//// по переданному названию находим имя макета в соответствии.
////
//// Параметры:
////  НазваниеМакета - строка, название макета.
////
//Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт
//	
//	Если ЭтоНовый() Тогда
//		Предупреждение(НСтр("ru = 'Документ можно распечатать только после его записи'"));
//		Возврат;
//	ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
//		Предупреждение(НСтр("ru = Недостаточно полномочий для печати непроведенного документа!'"));
//		Возврат;
//	КонецЕсли;
//	
//	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
//		Возврат;
//	КонецЕсли;
//	
//	// Получить экземпляр документа на печать
//	//Если ИмяМакета = "Информация" Тогда
//		//ТабДокумент = ПечатьИнформации();
//	Если ТипЗнч(ИмяМакета) = Тип("ДвоичныеДанные") Тогда
//		
//		ТабДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Ссылка, ИмяМакета);
//		
//		Если ТабДокумент = Неопределено Тогда
//			Возврат
//		КонецЕсли; 
//	КонецЕсли;
//	
//	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект), Ссылка);
//	
//КонецПроцедуры // Печать

//// Возвращает доступные варианты печати документа
////
//// Возвращаемое значение:
////  Структура, каждая строка которой соответствует одному из вариантов печати
////  
//Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
//	
//	СтруктПечатныхФорм = Новый Структура;
//	//СтруктПечатныхФорм.Вставить("Информация",          "Информация о переходящих отгрузках");
//	
//	Возврат СтруктПечатныхФорм;
//	
//КонецФункции // ПолучитьСтруктуруПечатныхФорм()

//#КонецЕсли

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	мУдалятьДвижения = НЕ ЭтоНовый();
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	Если ВидОперации = Перечисления.ПРГ_ВидыОперацийSLE.ВводПлана Тогда	
		РежимПроведения = Перечисления.ПРГ_ВидЗначенияSLE.ПлановоеЗначениеSLE;	
	ИначеЕсли ВидОперации = Перечисления.ПРГ_ВидыОперацийSLE.ВводФакта Тогда
		РежимПроведения = Перечисления.ПРГ_ВидЗначенияSLE.ФактическоеЗначениеSLE;	
	ИначеЕсли ВидОперации = Перечисления.ПРГ_ВидыОперацийSLE.ВВодПоРезультатуРабот Тогда
		РежимПроведения = Перечисления.ПРГ_ВидЗначенияSLE.РезультатРаботПоSLE;	
	ИначеЕсли ВидОперации = Перечисления.ПРГ_ВидыОперацийSLE.ВводОсобыхУсловий Тогда
		РежимПроведения = Перечисления.ПРГ_ВидЗначенияSLE.ОсобыеУсловияSLE;	
	КонецЕсли;

	ДвиженияПоРегиструДанныеSLE(РежимПроведения);

			
КонецПроцедуры

// Формируем движения по регистру ПартииТоваровНаСкладахМеждународныйУчет
//
Процедура ДвиженияПоРегиструДанныеSLE(РежимПроведения)

	
    НаборЗаписей       = РегистрыСведений.ПРГ_ДанныеSLE.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
    //НоваяЗапись        = НаборЗаписей.Добавить();
	Для Каждого ТекСтрока Из ЗначенияSLE Цикл
		Если РежимПроведения = Перечисления.ПРГ_ВидЗначенияSLE.ПлановоеЗначениеSLE Тогда
			НоваяЗапись        = НаборЗаписей.Добавить();
			НоваяЗапись.Регистратор  = Ссылка;        
			НоваяЗапись.Период       = Ссылка.Дата;
			НоваяЗапись.Организация = Организация;
			НоваяЗапись.Линия = ТекСтрока.Линия;
			НоваяЗапись.ПлановоеЗначениеSLE = ТекСтрока.ПлановоеЗначениеSLE;
			НоваяЗапись.ВидЗначенияSLE = РежимПроведения;
			НоваяЗапись.Подразделение = Подразделение;
		ИначеЕсли РежимПроведения = Перечисления.ПРГ_ВидЗначенияSLE.ФактическоеЗначениеSLE Тогда	
			НоваяЗапись        = НаборЗаписей.Добавить();
			НоваяЗапись.Регистратор  = Ссылка;        
			НоваяЗапись.Период       = Ссылка.Дата;
			НоваяЗапись.Организация = Организация;
			НоваяЗапись.Линия = ТекСтрока.Линия;
			НоваяЗапись.График = ТекСтрока.графикРабот;
			НоваяЗапись.ФактическоеЗначениеSLE = ТекСтрока.ФактическоеЗначениеSLE;
			НоваяЗапись.ВидЗначенияSLE = РежимПроведения;
			НоваяЗапись.Подразделение = Подразделение;
			НоваяЗапись.ПроцентНагрузки = ТекСтрока.ПроцентНагрузки;
		ИначеЕсли РежимПроведения = Перечисления.ПРГ_ВидЗначенияSLE.ОсобыеУсловияSLE Тогда  
			НоваяЗапись        = НаборЗаписей.Добавить();
			НоваяЗапись.Регистратор  = Ссылка;  
			НоваяЗапись.ВидЗначенияSLE = РежимПроведения;
			НоваяЗапись.Период       = Ссылка.Дата; 
			НоваяЗапись.Организация = Организация;
            НоваяЗапись.График = ТекСтрока.графикРабот;
			НоваяЗапись.Подразделение = ТекСтрока.подразделение;
			НоваяЗапись.Сотрудник = ТекСтрока.сотрудник;
			НоваяЗапись.Должность = ТекСтрока.Должность;
            НоваяЗапись.ПроцентВыполненияSLE = ТекСтрока.ПроцентВыполненияSLE;
		ИначеЕсли РежимПроведения = Перечисления.ПРГ_ВидЗначенияSLE.РезультатРаботПоSLE Тогда
			НоваяЗапись        = НаборЗаписей.Добавить();
			НоваяЗапись.Регистратор  = Ссылка;        
			НоваяЗапись.Период       = Ссылка.Дата; 
			НоваяЗапись.Организация = Организация;
			НоваяЗапись.ВидЗначенияSLE = РежимПроведения;
			НоваяЗапись.Линия = ТекСтрока.Линия;
			НоваяЗапись.График = ТекСтрока.графикРабот;
			НоваяЗапись.Подразделение = ТекСтрока.подразделение;
			НоваяЗапись.Сотрудник = ТекСтрока.сотрудник;
			НоваяЗапись.Должность = ТекСтрока.Должность;
			НоваяЗапись.ФактическоеЗначениеSLE = ТекСтрока.ФактическоеЗначениеSLE;
			НоваяЗапись.ПлановоеЗначениеSLE = ТекСтрока.ПлановоеЗначениеSLE;
			НоваяЗапись.ПроцентВыполненияSLE = ТекСтрока.ПроцентВыполненияSLE;
			НоваяЗапись.НачисленоПоSLE = ТекСтрока.СуммаПоSLE;
			НоваяЗапись.ПроцентНагрузки = ТекСтрока.ПроцентНагрузки;

		КонецЕсли;
    КонецЦикла;
    НаборЗаписей.Записать(); 
КонецПроцедуры // ДвиженияПоРегиструПартийТоваров()
